/*******************************************************
 Copyright (C), HangZhou Jianjia Co.,Ltd.
 File name:         app_task_park.c
 Author: PENG       Version: V1.0       Date:2026/04/23
 Description: 驻车任务处理
 Function List:
 History:
*******************************************************/
#include "app_task.h"
#include "bsp_gpio.h"


void StartParkTask(void *argument)
{
for(;;)
    {
        // 判断驻车按键状态
        if (GET_KEY_PARK() == GPIO_PIN_SET) 
        {
            // 按下：收回推杆
            BSP_ParkMotors_Retract();
        }
        else 
        {
            // 松开：顶起推杆
            BSP_ParkMotors_Extend();
        }

        osDelay(20); 
    }
    
}



/* =========================================================================
 * 描      述: 配合光电开关，实现3个推杆电机的独立收回与限位。光电开关备用控制原来代码复现
 * 目前推杆电机自带物理限位，此函数暂不调用。留存以备后用。
 * ========================================================================= */
#if 0 // 设为 1 即可开启编译

void BSP_ParkMotors_PSWITCH_Detect(void)
{
    // ----------------------------------------------------
    // 1号推杆电机：独立限位
    // ----------------------------------------------------
    if(PS1_READ() == GPIO_PIN_SET) 
    {
        // 碰到光电开关(高电平)，1号电机单独刹车停转
        M1_0_OFF();
        M1_1_OFF();
    }
    else 
    {
        // 没碰到，1号电机继续收回 (0相拉高，1相拉低)
        M1_0_ON();
        M1_1_OFF();
    }

    // ----------------------------------------------------
    // 2号推杆电机：独立限位
    // ----------------------------------------------------
    if(PS2_READ() == GPIO_PIN_SET)
    {
        // 碰到光电开关，2号电机单独刹车停转
        M2_0_OFF();
        M2_1_OFF();
    }
    else
    {
        // 没碰到，2号电机继续收回
        M2_0_ON();
        M2_1_OFF();
    }

    // ----------------------------------------------------
    // 3号推杆电机：独立限位
    // ----------------------------------------------------
    if(PS3_READ() == GPIO_PIN_SET)
    {
        // 碰到光电开关，3号电机单独刹车停转
        M3_0_OFF();
        M3_1_OFF();
    }
    else
    {
        // 没碰到，3号电机继续收回
        M3_0_ON();
        M3_1_OFF();
    }
}

#endif